1cExtension/Catalogs/ОбменДаннымиТипыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОбменДаннымиТипыДанных</Name>
			<Comment>Обмен данными типы данных</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗапросСКЛ</Name>
					<Comment>Запрос СКЛ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОбъекта</Name>
					<Comment>Менеджер объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
					<Comment>Данные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Comment>Тип данных</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбменДаннымиТипыДанных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапросСКЛ</Name>
							<Comment>Запрос СКЛ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1cExtension/Catalogs/ОбменДаннымиВидыСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОбменДаннымиВидыСообщений</Name>
			<Comment>Обмен данными виды сообщений</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОтправитьДанные</Name>
					<Comment>Отправить данные</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбменДаннымиВидыСообщений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НуженXML</Name>
					<Comment>Нужен XML</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерОбъекта</Name>
					<Comment>Менеджер объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВОтладке</Name>
					<Comment>В отладке</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Comment>Приоритет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключенНовыйОбмен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикДобавления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Данные</Name>
					<Comment>Данные</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипДанных</Name>
							<Comment>Тип данных</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Comment>Имя реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапросСКЛ</Name>
							<Comment>Запрос СКЛ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВременныеТаблицы</Name>
					<Comment>Временные таблицы</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяТаблицы</Name>
							<Comment>Имя таблицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапросСКЛ</Name>
							<Comment>Запрос СКЛ</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1cExtension/Catalogs/ОбменДаннымиТипыДанных/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	МассивТипов=Новый Массив;
	МассивТипов.Добавить(ЭтотОбъект.Ссылка);
	
	
	Запрос=Новый Запрос("
	| SELECT DISTINCT
	|    Ссылка
	| FROM
	|    Справочник.ОбменДаннымиТипыДанных.Данные
	| WHERE
	|    ТипДанных IN (&МассивТипов)
	|    AND Ссылка NOT IN (&МассивТипов)
	|");
	
	Пока Истина Цикл
		Запрос.УстановитьПараметр("МассивТипов",МассивТипов);
		Рез=Запрос.Выполнить();
		Если Рез.Пустой() Тогда
		    Прервать;	
		КонецЕсли;	
		Выб=Рез.Выбрать();
		Пока Выб.Следующий() Цикл
			МассивТипов.Добавить(Выб.Ссылка);
		КонецЦикла;	
	КонецЦикла;	
	
	Запрос.Текст="
	| SELECT
	|    Ссылка
	| FROM
	|    Справочник.ОбменДаннымиВидыСообщений.Данные
	| WHERE
	|    ТипДанных IN (&МассивТипов)
	|";
	
	Запрос.УстановитьПараметр("МассивТипов",МассивТипов);
	
	Выб=Запрос.Выполнить().Выбрать();
	Пока Выб.Следующий() Цикл
		МенЗап=РегистрыСведений.ОбменДаннымиЗапросыСКЛ.СоздатьМенеджерЗаписи();
		МенЗап.ВидСообщения=Выб.Ссылка;
		МенЗап.Прочитать();
		МенЗап.ВидСообщения=Выб.Ссылка;
		МенЗап.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры
